{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 10, 1], "input_dtype": "float32", "sparse": false, "name": "state_input"}, "inbound_nodes": [], "name": "state_input"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 4, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 4}, "inbound_nodes": [[["state_input", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 2}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 64, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 800, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "batch_input_shape": [null, 800]}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "input_dtype": "float32", "sparse": false, "name": "action_mask"}, "inbound_nodes": [], "name": "action_mask"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "action_output", "output_dim": 4, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 64, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 64]}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "action_output"}, {"class_name": "Merge", "config": {"name": "merged_output", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "mul", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["action_mask", 0, 0], ["action_output", 0, 0]]], "name": "merged_output"}], "input_layers": [["state_input", 0, 0], ["action_mask", 0, 0]], "output_layers": [["merged_output", 0, 0]], "name": "model_1"}}